# SpaceSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpaceSetIterator Class
Members See Also
---
An iterator to a set.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class SpaceSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class SpaceSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class SpaceSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Mechanical..::..SpaceSetIterator
# See Also
SpaceSetIterator Members
Autodesk.Revit.DB.Mechanical Namespace